import saas from './lp/saas.uk';
import startup from './lp/startup.uk';
import mobileApp from './lp/mobile-app.uk';
import landings from './lp/landings.uk';

export const uk = {
  header: {
    homes: { title: 'Головна', saas: 'Saas', startup: 'Стартап', app: 'Завантажити додаток', personal: 'Особисте' },
    pages: { title: 'Сторінки', features: 'Функції', services: 'Послуги', pricing: 'Ціни', aboutUs: 'Про нас', contactUs: 'Контакти', terms: 'Умови', privacyPolicy: 'Політика конфіденційності' },
    landing: { title: 'Лендінг', leadGeneration: 'Генерація лідів', sales: 'Довгі продажі', clickThrough: 'Клікабельна сторінка', squeeze: 'Squeeze', product: 'Інформація про продукт', comingSoon: 'Незабаром', gallery: 'Галерея',
      galleryHero: { tagline: 'Портфоліо', title: 'Наші проекти', subtitle: 'Дізнайтеся про наші нещодавні проекти та історії успіху.', goBack: 'Назад' }, },
    blog: { title: 'Блог', blogList: 'Список статей', article: 'Стаття', articleMdx: 'Стаття (з MDX)', category: 'Сторінка категорії', tag: 'Сторінка тегу' },
    widgets: 'Віджети', contact: 'Контакти', download: 'Завантажити',
  },
  footer: {
    product: { title: 'Продукт', features: 'Функції', security: 'Безпека', team: 'Команда', enterprise: 'Корпоративний', customerStories: 'Історії клієнтів', pricing: 'Ціни', resources: 'Ресурси' },
    platform: { title: 'Платформа', developerAPIs: 'API для розробників', partners: 'Партнери', atom: 'Atom', electron: 'Electron', astrowindDesktop: 'AstroWind Desktop' },
    support: { title: 'Підтримка', docs: 'Документація', communityForum: 'Форум спільноти', professionalServices: 'Професійні послуги', skills: 'Навички', status: 'Статус' },
    company: { title: 'Компанія', about: 'Про компанію', blog: 'Блог', careers: 'Кар\'єра', press: 'Преса', inclusion: 'Інклюзивність', socialImpact: 'Соціальний вплив', shop: 'Магазин' },
    legal: { terms: 'Умови', privacy: 'Конфіденційність' },
  },
  index: {
    metadata: {
      title: 'AstroWind — безкоштовний шаблон для створення сайтів на Astro + Tailwind CSS',
    },
    hero: {
      cta: 'Отримати шаблон',
      cta2: 'Дізнатися більше',
      imageAlt: 'Зображення AstroWind Hero',
      title: {
        part1: 'Безкоштовний шаблон для ',
        part2: 'створення сайтів на',
      },
      subtitle: 'це безкоштовний, настроюваний та готовий до використання шаблон для Astro 3.0',
      description:
        'Підходить для стартапів, малого бізнесу, SaaS-сайтів, професійних портфоліо, маркетингових сторінок, лендінгів та блогів.',
    },
    features: {
      tagline: 'Функції',
      title: 'Що ви отримуєте з AstroWind',
      subtitle:
        'Один із найбільш професійних та комплексних шаблонів на ринку. Найпопулярніша тема Astro за кількістю зірок та форків у 2022 році.',
      items: [
        {
          title: 'Інтеграція Astro + Tailwind CSS',
          description:
            'Безшовна інтеграція між двома чудовими фреймворками, що забезпечують високу продуктивність та універсальність.',
          icon: 'tabler:brand-tailwind',
        },
        {
          title: 'Готові компоненти',
          description:
            'Віджети на Tailwind CSS, готові для використання на маркетингових сайтах, SaaS, блогах, особистих профілях тощо.',
          icon: 'tabler:components',
        },
        {
          title: 'Кращі практики',
          description:
            'Створення безпечних, ефективних та зручних сайтів, які забезпечують винятковий досвід користувача.',
          icon: 'tabler:list-check',
        },
        {
          title: 'Відмінна швидкість сторінки',
          description:
            'Висока швидкість завантаження впливає на рейтинг в органічному пошуку та покращує конверсію.',
          icon: 'tabler:rocket',
        },
        {
          title: 'SEO оптимізація',
          description:
            "Здатність покращити видимість сайту, залучаючи органічний трафік та охоплюючи ширшу аудиторію.",
          icon: 'tabler:arrows-right-left',
        },
        {
          title: 'Відкритість до ідей',
          description:
            'Культура, відкрита до нових ідей та внесків, що сприяє інноваціям та динамічному розвитку.',
          icon: 'tabler:bulb',
        },
      ],
    },
    content: {
      tagline: 'Всередині шаблону',
      title: "Структура AstroWind: поєднання фану та функціональності!",
      imageAlt: 'Кольорове зображення',
      additionalTitle: 'Побудовано на сучасних основах',
      additionalDescription: 'Отримайте конкурентну перевагу, впроваджуючи провідні галузеві практики',
      items: [
        {
          title: 'На базі Astro 3.0',
          description:
            'Скористайтеся перевагами продуктивності та зручності для розробників цього сучасного генератора статичних сайтів.',
        },
        {
          title: 'Стилі за допомогою Tailwind CSS',
          description:
            'Швидке проектування та узгоджені стилі з цим надпопулярним CSS-фреймворком.',
        },
        {
          title: 'Кросбраузерна сумісність',
          description:
            'Ваш сайт виглядатиме та працюватиме однаково у всіх сучасних браузерах.',
        },
      ],
    },
    content2: {
      additionalDescription: 'Переконайтеся, що ваша онлайн-присутність справді представляє вас.',
      items: [
        {
          title: 'Високий рівень кастомізації',
          description: `Легко налаштуйте шаблон відповідно до вашого бренду, заощаджуючи час.`,
        },
        {
          title: 'Різноманітність макетів',
          description:
            'Досліджуйте різні варіанти структури для найкращої подачі вашого контенту.',
        },
        {
          title: 'Повністю адаптивний дизайн',
          description:
            "Оптимальна робота на різних пристроях та екранах будь-якого розміру.",
        },
        {
          title: 'Інтеграція медіа',
          description:
            'Легко додавайте зображення, відео та мультимедійні елементи для залучення відвідувачів.',
        },
      ],
    },
    content3: {
      additionalDescription: 'Створено для зростання та успіху.',
      items: [
        {
          title: 'Покращене залучення користувачів',
          description:
            'Захоплюйте аудиторію інтерактивними елементами та інтуїтивно зрозумілою навігацією.',
        },
        {
          title: 'Постійне вдосконалення',
          description:
            'Ваш сайт відповідатиме останнім трендам завдяки регулярним оновленням.',
        },
        {
          title: 'Ефективність ресурсів',
          description:
            'Пропустіть довгий процес створення сайту з нуля — запустіться швидше з AstroWind.',
        },
        {
          title: 'Підтримка спільноти',
          description: `Приєднуйтесь до спільноти AstroWind для отримання порад та допомоги.`,
        },
      ],
    },
    steps: {
      title: 'Запустіть сайт вашої мрії в найкоротші терміни з AstroWind.',
      imageAlt: 'Зображення кроків',
      items: [
        {
          title: 'Крок 1: <span class="font-medium">Завантаження</span>',
          description:
            'Завантажте шаблон та встановіть необхідні залежності для старту роботи.',
          icon: 'tabler:package',
        },
        {
          title: 'Крок 2: <span class="font-medium">Додавання контенту</em>',
          description:
            'Наповніть сторінки власними текстами, зображеннями та важливою інформацією.',
          icon: 'tabler:letter-case',
        },
        {
          title: 'Крок 3: <span class="font-medium">Налаштування стилів</span>',
          description:
            'Змініть кольори, шрифти та макети, щоб вони ідеально підходили вашому бренду.',
          icon: 'tabler:paint',
        },
        {
          title: 'Готово!',
          icon: 'tabler:check',
        },
      ],
    },
    features2: {
      title: 'Найпопулярніші віджети',
      subtitle: 'Часто використовувані компоненти для побудови сайтів на Tailwind CSS',
      tagline: 'Компоненти',
      items: [
        {
          title: 'Шапки (Headers)',
          description: "Навігація — це GPS вашого сайту. Вона вказує користувачам вірний шлях.",
          icon: 'flat-color-icons:template',
        },
        {
          title: 'Герої (Heros)',
          description:
            "Перше враження — найважливіше. Секція Hero робить ваш вхід епічним!",
          icon: 'flat-color-icons:gallery',
        },
        {
          title: 'Функції',
          description:
            'Тут ваш сайт демонструє свої суперсили. Не соромтеся вихвалятися!',
          icon: 'flat-color-icons:approval',
        },
        {
          title: 'Контент',
          description:
            "Суть вашого сайту. Без якісного контенту відвідувач просто пройде повз.",
          icon: 'flat-color-icons:document',
        },
        {
          title: 'Заклик до дії (CTA)',
          description:
            'Та сама кнопка, яка підштовхує користувача до дії та нових пригод.',
          icon: 'flat-color-icons:advertising',
        },
        {
          title: 'Ціни',
          description: 'Меню десертів вашого сайту. Спокусливі пропозиції, перед якими важко встояти.',
          icon: 'flat-color-icons:currency-exchange',
        },
        {
          title: 'Відгуки',
          description: 'Куточок довіри. Тут інші відвідувачі діляться своїми враженнями.',
          icon: 'flat-color-icons:voice-presentation',
        },
        {
          title: 'Контакти',
          description:
            'Цифрова поштова скринька. Напишіть питання або просто привітайтеся.',
          icon: 'flat-color-icons:business-contact',
        },
        {
          title: 'Підвали (Footers)',
          description: "Фінальні титри сайту, де приховані важливі посилання та корисні дрібниці.",
          icon: 'flat-color-icons:database',
        },
      ],
    },
    blogLatestPosts: {
      title: 'Дізнайтеся більше у нашому Блозі',
      information: `Блог використовується для відображення документації AstroWind.
                    Кожна нова стаття допоможе вам стати експертом у створенні сайтів на Astro + Tailwind CSS.`,
    },
    faqs: {
      title: 'Поширені запитання',
      subtitle:
        'Ознайомтеся з відповідями, щоб зрозуміти можливості AstroWind та покращити свій шлях у веб-розробці.',
      tagline: 'FAQ',
      items: [
        {
          title: 'Чому AstroWind?',
          description:
            "Це сучасний, швидкий та легкий шаблон, який економить сотні годин розробки.",
        },
        {
          title: 'Що мені потрібно для старту?',
          description:
            'Базові знання HTML, CSS та встановлений Node.js на вашому комп\'ютері.',
        },
        {
          title: 'Як встановити шаблон?',
          description:
            "Просто схилюйте репозиторій, запустіть встановлення пакетів та насолоджуйтеся результатом.",
        },
      ],
    },
    stats: {
      stats: [
        { title: 'Завантажень', amount: '132K' },
        { title: 'Зірок', amount: '24.8K' },
        { title: 'Форків', amount: '10.3K' },
        { title: 'Користувачів', amount: '48.4K' },
      ],
    },
    callToAction: {
      cta: {
        text: 'Отримати шаблон',
      },
      subtitle: {
        part1: 'Будьте вражені цими величезними цифрами, які ви бачите на сторінці.',
        part2: "Не гайте часу! :P",
      },
    },
  },
  blog: { 
    title: 'Блог', 
    subtitle: 'Статичний приклад блогу з новинами, навчальними матеріалами та іншою цікавою інформацією.',
    tags: 'Теги:',
  },
  personal_p: {
    cta: {
      title: "Творімо разом",
      subtitle: "Готові втілити ваше бачення у захоплюючий дизайн?",
      cta: {
        text: "Найняти мене",
        href: "/contact"
      },
    },
    metadata: {
      title: "Демо особистої сторінки",
    },
    links: [
      { text: "Головна", href: "/" },
      { text: "Про мене", href: "#about" },
      { text: "Резюме", href: "#resume" },
      { text: "Портфоліо", href: "#portfolio" },
      { text: "Блог", href: "#blog" },
      { text: "Github", href: "https://github.com/" },
    ],
    actions: [
      { text: "Найняти мене", href: "#contact" },
    ],
    hero: {
      title: "Сара Джонсон",
      tagline: "Персональне демо",
      cta: {
        text: "Найняти мене",
        href: "/contact"
      },
      subtitle: "Я графічний дизайнер, захоплений створенням візуальних історій. З 5-річним досвідом та освітою Школи дизайну Нью-Йоркського університету, я вдихаю життя в бренди, перетворюючи концепції на захоплюючу реальність.",
    },
    about: {
      title: "Про мене",
      paragraph1: "Ласкаво просимо до моєї творчої подорожі. Моя робота — це свідчення мого прагнення втілювати ідеї в життя, де кожен піксель стає мазком на полотні уяви.",
      paragraph2: "Я знаходжу натхнення в навколишньому світі: чи то в сторінках захоплюючого роману, складних деталях типографіки, чи в яскравих відтінках природи під час моїх пригод на свіжому повітрі.",
      paragraph3: "Якщо вам цікаво зануритися глибше в мою роботу, ви можете стежити за мною тут:",
      items: [
        { title: "Dribbble", icon: 'tabler:brand-dribbble' },
        { title: "Behance", icon: 'tabler:brand-behance' },
        { title: "Pinterest", icon: 'tabler:brand-pinterest' }
      ],
      image: {
        src: "https://images.unsplash.com/photo-1491349174775-aaafddd81942?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=774&q=80",
        alt: "Кольорове зображення"
      }
    },
    content: {
      portfolio: {
        title: "Вдосконалення візуальних розповідей",
        subtitle: "Відправтеся в дизайнерську подорож, що виходить за межі пікселів. Дослідіть моє портфоліо, де пристрасть і креативність сходяться для створення захоплюючих візуальних наративів.",
        items: [
          {
            title: "Айдентика бренду для технологічних інноваторів",
            description: "Розробила комплексну айдентику бренду для тех-стартапу Tech Innovators. Метою було передати сучасний, але доступний образ.",
            role: "Керувала процесом брендингу від концепції до виконання. Створила динамічний логотип, підібрала яскраву палітру кольорів та розробила графіку для сайту.",
          },
          {
            title: "Постер для фестивалю мистецтва та музики",
            description: "Створила захоплюючий постер для фестивалю 'ArtWave Fusion', демонструючи синергію між візуальним мистецтвом та музикою.",
            role: "Втілила творчу тему фестивалю у вражаючому постері, використовуючи сміливу типографіку та абстрактні елементи.",
          },
          {
            title: "Редізайн e-commerce сайту для модного бренду",
            description: "Оновила дизайн інтернет-магазину для еко-френдлі бренду GreenVogue, щоб покращити досвід користувачів.",
            role: "Провела аналіз цінностей бренду, створила інтуїтивно зрозумілий інтерфейс та інтегрувала зручну систему покупок.",
          },
        ],
        image: ""
      },
    },
    steps: {
      workExperience: [
        {
          title: "Графічний дизайнер в ABC Design Studio, Нью-Йорк (2021 — дотепер)",
          description: "Співпраця з клієнтами для розробки брендингових рішень, включаючи логотипи та гайдлайни. Дизайн маркетингових матеріалів та інтерфейсів.",
          icon: 'tabler:briefcase',
        },
        {
          title: "Молодший дизайнер у XYZ Creative Agency, Лос-Анджелес (2018 — 2021)",
          description: "Допомога старшим дизайнерам у створенні концепцій та візуальних активів. Робота над айдентикою брендів.",
          icon: 'tabler:briefcase',
        },
      ],
      education: [
        {
          title: "Магістр образотворчого мистецтва (Графічний дизайн), Школа дизайну Нью-Йоркського університету (2018 — 2020)",
          icon: 'tabler:school',
        },
        {
          title: "Бакалавр графічного дизайну, Школа дизайну Нью-Йоркського університету (2014 — 2018)",
          icon: 'tabler:school',
        },
      ],
    },
    skills: {
      title: "Навички",
      subtitle: "Дізнайтеся про вміння, які дозволяють мені втілювати уяву в життя через дизайн.",
      items: [
        { title: 'Графічний дизайн', description: 'Створення візуально привабливих дизайнів для ефективної комунікації.' },
        { title: 'Брендинг та айдентика', description: 'Розробка цілісних образів бренду, включаючи логотипи та правила використання.' },
        { title: 'Дизайн, орієнтований на користувача', description: 'Досвід створення зручних інтерфейсів та оптимізації UX.' },
        { title: 'Adobe Creative Suite', description: 'Володіння Photoshop, Illustrator та InDesign на високому рівні.' },
        { title: 'Типографіка', description: 'Вміння підбирати та маніпулювати шрифтами для покращення естетики.' },
        { title: 'Теорія кольору', description: 'Використання кольору для викликання емоцій та гармонії.' },
        { title: 'Принт та діджитал дизайн', description: 'Знання особливостей дизайну як для друку, так і для цифрових платформ.' },
        { title: 'Увага до деталей', description: 'Ретельність у підтримці точності та якості у всіх роботах.' },
        { title: 'Адаптивність', description: 'Швидке пристосування до нових трендів, технологій та побажань клієнтів.' },
      ],
    },
    testimonials: {
      title: "Відгуки",
      subtitle: "Що люди говорять про мою роботу",
      items: [
        {
          testimonial: "Вона перетворила нашу нечітку концепцію на візуальний шедевр. Її увага до деталей перевершила наші очікування.",
          name: "Марк Томпсон",
          job: "Креативний директор",
          image: { src: 'https://images.unsplash.com/photo-1500648767791-00dcc994a43e?auto=format&fit=crop&w=774&q=80', alt: 'Mark Thompson' },
        },
        {
          testimonial: "Її талант і відданість справі сяють у кожному елементі нашого нового бренду.",
          name: "Емілі Мартінес",
          job: "CEO",
          image: { src: 'https://images.unsplash.com/photo-1554151228-14d9def656e4?auto=format&fit=crop&w=772&q=80', alt: 'Emily Martinez' },
        }
      ],
    },
    portfolio: {
      callToAction: {
        title: "Творімо разом",
        subtitle: "Готові перетворити ваше бачення на захоплюючий дизайн?",
        action: "Найняти мене",
        button: "Найняти мене",
        href: "/",
      },
    },
    blog: {
        title: "Досліджуйте корисні статті в моєму блозі",
        information: "Пориньте у світ дизайнерської мудрості та творчого натхнення, де ви знайдете практичні поради та цікаві історії.",
    },
  },

  lp: {
    saas,
    startup,
    mobileApp,
    landings,
  },
};





